
/********************************************************************************************
  * Company: Wang Electronic Technology Co., Ltd.
  ********************************************************************************************
  * 文件名称：KEY.c
  * 功能说明：按键驱动程序
  * 版    本：V1.1
  * 作    者：openmcu666   
  * 日    期: 20160111
***********************************************************************************************
  * 文件名称：
  * 功能说明：
  * 版    本：
  * 更新作者: 
  * 日    期：
  * 更新原因：
************************************************************************************************/

#include "key.h"
#include <lpc17xx.h>
#include "lpc17xx_gpio.h"
#include "lpc17xx_libcfg.h"
#include "lpc17xx_pinsel.h"


/************************************************************************************************
KEY硬件接口:

INIT0---------------->P2.10
KEY1----------------->P2.11
KEY2----------------->P2.12

五向按键:
JOY_SEL-------------->P2.25
JOY_DOWN------------->P2.26
JOY_LEFT------------->P2.27
JOY_RIGHT------------>P2.28
JOY_UP--------------->P2.29
*************************************************************************************************/

/************************************************************************************************
函数名: KEY_Config(void)
函数功能:KEY初始化管脚配置
参数:无
返回值:无
*************************************************************************************************/

void KEY_Config(void){
	
	PINSEL_CFG_Type PinCfg;
	PinCfg.Funcnum = 0;//普通GPIO功能
	PinCfg.Portnum = 2;	//端口号
	PinCfg.Pinnum = 10;//
	PINSEL_ConfigPin(&PinCfg);
	
	PinCfg.Pinnum = 11;//
	PINSEL_ConfigPin(&PinCfg);
	PinCfg.Pinnum = 12;
	PINSEL_ConfigPin(&PinCfg);	


	GPIO_SetDir(2, (1<<10)|(1<<11)|(1<<12), 0); //设置端口输入模式       
	
}

/************************************************************************************************
函数名:void Delay (uint32_t Time)
函数功能:延时函数
参数:延时时间
返回值:无
*************************************************************************************************/
void Delay (uint32_t Time)
{
    uint32_t i;
    
    i = 0;
    while (Time--) {
        for (i = 0; i < 10; i++);
    }
}


/************************************************************************************************
函数名:int INIT0_Scan(void)
函数功能:INIT0按键扫描函数
参数:无
返回值:1按下,0不按下
*************************************************************************************************/
int Init0_Scan(void)
{    
    static int key_up0=0;//按键按松开标志  

	
	  if(((GPIO_ReadValue(2)>>10)&0x01)==0)

    {
        
            Delay(1);   //延时去抖动 
      if((((GPIO_ReadValue(2))>>10)&0x01)==0)
   
        {
            key_up0=1;
    }
        
     }
		
		 if((((GPIO_ReadValue(2)>>10)&0x01)==1)&&(key_up0==1))
     {
        key_up0=0;
    return 1;
    }
        return 0;
}
/************************************************************************************************
函数名:int Key1_Scan(void)
函数功能:key1按键扫描函数
参数:无
返回值:1按下,0不按下
*************************************************************************************************/
int Key1_Scan(void)
{    
    static int key_up0=0;//按键按松开标志  

    if(((GPIO_ReadValue(2)>>11)&0x01)==0)
    {
    
            Delay(3);   //延时去抖动 
    
        if(((GPIO_ReadValue(2)>>11)&0x01)==0)
        {
            key_up0=1;
    }
        
     }
     if((((GPIO_ReadValue(2)>>11)&0x01)==1)&&(key_up0==1))
     {
         
        key_up0=0;
    return 1;
         
    }
        return 0;
}
/************************************************************************************************
函数名:int Key2_Scan(void)
函数功能:key2按键扫描函数
参数:无
返回值:1按下,0不按下
*************************************************************************************************/
int Key2_Scan(void)
{    
    static int key_up0=0;//按键按松开标志  

    if(((GPIO_ReadValue(2)>>12)&0x01)==0)
    {
        
            Delay(3);//延时去抖动 
    
         if(((GPIO_ReadValue(2)>>12)&0x01)==0)
        {
            key_up0=1;
    }
        
     }
    if((((GPIO_ReadValue(2)>>12)&0x01)==1)&&(key_up0==1))
     {
        key_up0=0;
    return 1;
    }
        return 0;
}

/************************************************************************************************
函数名:int Key_Scan(void)
函数功能:扫描KEY函数
参数:无
返回值:返回按键码
*************************************************************************************************/
int Key_Scan(void)
{    
    int key_code;

   if(Init0_Scan()==1)//按键按下，LED
     {
         
         key_code=1;
        
     }
        else if(Key1_Scan()==1)
        {
            
            key_code=2;
            
        }   
        
    else if(Key2_Scan()==1)
    {
        
      key_code=3;
        
    }

    else 
    {
    key_code=0;
    }
    
    
    return key_code;
}

    
    