/********************************************************************************************
  * Company: Wang Electronic Technology Co., Ltd.
  ********************************************************************************************
  * 文件名称：LED.c
  * 功能说明：LED驱动程序
  * 版    本：V1.1
  * 作    者：openmcu666	
  * 日    期: 20160111
***********************************************************************************************
  * 文件名称：
  * 功能说明：
  * 版    本：
  * 更新作者: 
  * 日    期：
  * 更新原因：
************************************************************************************************/
/************************************************************************************************
LED硬件接口:
											 
LED4------------->P2.0
LED5------------->P2.1
LED6------------->P2.2
LED7------------->P2.3
LED8------------->P2.4
LED9------------->P2.5
LED10------------>P2.6
LED11------------>P2.7
*************************************************************************************************/

#include "led.h"
#include "lpc17xx_gpio.h"
#include "lpc17xx_libcfg.h"
#include "lpc17xx_pinsel.h"
#include "systen_delay.h"
void LED_Configuration(void)
{

	PINSEL_CFG_Type PinCfg;
	PinCfg.Funcnum = 0;//普通GPIO功能
	PinCfg.Portnum = 2;	//端口号
	PinCfg.Pinnum = 0;//GPIO2_0
	PinCfg.Pinnum = 1;//GPIO2_1
	PinCfg.Pinnum = 2;//GPIO2_2
	PinCfg.Pinnum = 3;//GPIO2_3
	PinCfg.Pinnum = 4;//GPIO2_4
	PinCfg.Pinnum = 5;//GPIO2_5
	PinCfg.Pinnum = 6;//GPIO2_6
	PinCfg.Pinnum = 7;//GPIO2_7
	PINSEL_ConfigPin(&PinCfg);
	

	GPIO_SetDir(2, (1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7), 1); //设置端口输出模式       
	GPIO_ClearValue(2, (1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7));//初始化设置输出高电平
}

